# CurveUV Properties

---
The CurveUV type exposes the following members.
| Name| Description
---|---|---
| IsBound|  Describes whether the parameter of the curve is restricted to a particular interval.
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity.
Top
#### Reference
CurveUV Class
Autodesk.Revit.DB Namespace